tests/grpc/performance/results/ghz-grpc-apigw-result.txt

Summary:
  Count:	8489
  Total:	30.00 s
  Slowest:	1.12 s
  Fastest:	1.05 ms
  Average:	353.09 ms
  Requests/sec:	282.96

Response time histogram:
  1.053    [1]    |
  113.343  [1136] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  225.633  [1457] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  337.923  [1367] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  450.213  [1426] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  562.503  [1623] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  674.793  [580]  |∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  787.083  [410]  |∎∎∎∎∎∎∎∎∎∎
  899.373  [158]  |∎∎∎∎
  1011.663 [64]   |∎∎
  1123.953 [21]   |∎

Latency distribution:
  10 % in 95.41 ms 
  25 % in 187.58 ms 
  50 % in 362.21 ms 
  75 % in 469.58 ms 
  90 % in 646.92 ms 
  95 % in 739.62 ms 
  99 % in 908.90 ms 

Status code distribution:
  [Unavailable]   246 responses    
  [OK]            8243 responses   

Error distribution:
  [146]   rpc error: code = Unavailable desc = the connection is draining                                                                       
  [100]   rpc error: code = Unavailable desc = error reading from server: read tcp [::1]:54039->[::1]:50551: use of closed network connection