tests/grpc/performance/results/ghz-grpc-apigw-result.txt

Summary:
  Count:	8096
  Total:	30.00 s
  Slowest:	1.49 s
  Fastest:	1.57 ms
  Average:	370.05 ms
  Requests/sec:	269.86

Response time histogram:
  1.571    [1]    |
  150.832  [813]  |∎∎∎∎∎∎∎∎∎∎∎∎∎
  300.093  [2565] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  449.354  [1492] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  598.615  [2017] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  747.876  [610]  |∎∎∎∎∎∎∎∎∎∎
  897.137  [204]  |∎∎∎
  1046.398 [103]  |∎∎
  1195.659 [21]   |
  1344.920 [14]   |
  1494.181 [3]    |

Latency distribution:
  10 % in 106.18 ms 
  25 % in 202.52 ms 
  50 % in 367.04 ms 
  75 % in 472.38 ms 
  90 % in 643.41 ms 
  95 % in 739.75 ms 
  99 % in 953.85 ms 

Status code distribution:
  [OK]            7843 responses   
  [Unavailable]   253 responses    

Error distribution:
  [153]   rpc error: code = Unavailable desc = the connection is draining                                                                       
  [100]   rpc error: code = Unavailable desc = error reading from server: read tcp [::1]:53872->[::1]:50551: use of closed network connection